## Plan Result (prod-enterprise)




<pre><code>Plan: 157 to add, 70 to change, 0 to destroy.</code></pre>

* Create
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_application.app
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].time_rotating.one_year
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].random_uuid.app_uuid
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].time_rotating.one_year
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].random_uuid.app_uuid
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].time_rotating.one_year
* Update
  * module.enterprise.azurerm_management_group.level_2[&#34;Security&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;Heritage-NonProd&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;Heritage-Prod&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;Heritage-Sandbox&#34;]
  * module.environment[&#34;prod&#34;].azuread_application.app
  * module.environment[&#34;ptlsbox&#34;].azuread_application.app
  * module.subscription[&#34;DTS-HERITAGE-AVS-SBOX&#34;].azuread_application.app
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuread_application.app
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuread_application.app
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuread_application.app
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_subscription.this
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_application.app
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_subscription.this
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_application.app
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_subscription.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.azurerm_management_group.level_2["Security"] will be updated in-place
  ~ resource "azurerm_management_group" "level_2" {
        id                         = "/providers/Microsoft.Management/managementGroups/Security"
        name                       = "Security"
      ~ subscription_ids           = [
          + "2307d175-7e49-434b-9ac2-515529b845f2",
          + "8ae5b3b6-0b12-4888-b894-4cec33c92292",
        ]
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.azurerm_management_group.level_3["Heritage-NonProd"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/Heritage-NonProd"
        name                       = "Heritage-NonProd"
      ~ subscription_ids           = [
          + "9c604868-4643-43b8-9eb1-4c348c739a3e",
          + "ae75b9fb-7d34-4112-82ff-64bd3855ce27",
        ]
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.azurerm_management_group.level_3["Heritage-Prod"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/Heritage-Prod"
        name                       = "Heritage-Prod"
      ~ subscription_ids           = [
          + "17390ec1-5a5e-4a20-afb3-38d8d726ae45",
          + "c170c61a-f00f-4295-a718-634e27af1597",
        ]
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.azurerm_management_group.level_3["Heritage-Sandbox"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/Heritage-Sandbox"
        name                       = "Heritage-Sandbox"
      ~ subscription_ids           = [] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.environment["prod"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "9c149b18-7537-4b03-9093-641191faee0b"
      ~ owners                         = [
          - "6d2f8452-ba93-4a50-87a5-16e00f73af47",
        ]
        tags                           = []
        # (14 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.environment["ptlsbox"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "3fdcf12a-6a2c-46fc-be16-71510f849748"
      ~ owners                         = [
          - "23b042ae-86bd-4bb1-a9c0-04a24e1b435f",
        ]
        tags                           = []
        # (14 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.subscription["DTS-HERITAGE-AVS-SBOX"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "93a90ed0-76c3-4a1a-b09c-2ddc1737d20e"
      ~ oauth2_permission_scope_ids    = {
          - "user_impersonation" = "263a1c5d-1d54-ece0-15c3-a3f939ffdd83"
        } -> (known after apply)
        tags                           = []
        # (14 unchanged attributes hidden)

      ~ api {
            # (3 unchanged attributes hidden)

          - oauth2_permission_scope {
              - admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dts-heritage-avs-sbox) on behalf of the signed-in user." -> null
              - admin_consent_display_name = "Access DTS Bootstrap (sub:dts-heritage-avs-sbox)" -> null
              - enabled                    = true -> null
              - id                         = "263a1c5d-1d54-ece0-15c3-a3f939ffdd83" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dts-heritage-avs-sbox) on your behalf." -> null
              - user_consent_display_name  = "Access DTS Bootstrap (sub:dts-heritage-avs-sbox)" -> null
              - value                      = "user_impersonation" -> null
            }
          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dts-heritage-avs-sbox) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Bootstrap (sub:dts-heritage-avs-sbox)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dts-heritage-avs-sbox) on your behalf."
              + user_consent_display_name  = "Access DTS Bootstrap (sub:dts-heritage-avs-sbox)"
              + value                      = "user_impersonation"
            }
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
          + resource_access {
              + id   = "5b567255-7703-4780-807c-7be8301ae99b"
              + type = "Role"
            }
          + resource_access {
              + id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"
              + type = "Role"
            }
        }
      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "06da0dbc-49e2-44d2-8312-53f166ab848a" -> null
              - type = "Scope" -> null
            }
        }

      ~ web {
          ~ homepage_url  = "https://dts-bootstrap-application" -> "https://dev.azure.com/hmcts/PlatformOperations"
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.subscription["DTS-HERITAGE-AVS-SBOX"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = "93a90ed0-76c3-4a1a-b09c-2ddc1737d20e"
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.subscription["DTS-HERITAGE-AVS-SBOX"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster admin permissions to the DTS-HERITAGE-AVS-SBOX subscription"
      + display_name                   = "DTS AKS Administrators (sub:dts-heritage-avs-sbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-HERITAGE-AVS-SBOX"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster user permissions to the DTS-HERITAGE-AVS-SBOX subscription"
      + display_name                   = "DTS AKS Users (sub:dts-heritage-avs-sbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-HERITAGE-AVS-SBOX"].azuread_group.groups["Contributor"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants contributor permissions to the DTS-HERITAGE-AVS-SBOX subscription"
      + display_name                   = "DTS Contributors (sub:dts-heritage-avs-sbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-HERITAGE-AVS-SBOX"].azuread_group.groups["Key Vault Administrator"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants key vault administrator permissions to the DTS-HERITAGE-AVS-SBOX subscription"
      + display_name                   = "DTS Key Vault Administrators (sub:dts-heritage-avs-sbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-HERITAGE-AVS-SBOX"].azuread_group.groups["Owner"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants owner permissions to the DTS-HERITAGE-AVS-SBOX subscription"
      + display_name                   = "DTS Owners (sub:dts-heritage-avs-sbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-HERITAGE-AVS-SBOX"].azuread_group.groups["Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants reader permissions to the DTS-HERITAGE-AVS-SBOX subscription"
      + display_name                   = "DTS Readers (sub:dts-heritage-avs-sbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-HERITAGE-AVS-SBOX"].azuread_group.groups["Security Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants security reader permissions to the DTS-HERITAGE-AVS-SBOX subscription"
      + display_name                   = "DTS Security Readers (sub:dts-heritage-avs-sbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-HERITAGE-AVS-SBOX"].azuread_group.groups["Storage Blob Data Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants storage blob data contributor permissions to the DTS-HERITAGE-AVS-SBOX subscription"
      + display_name                   = "DTS Blob Readers (sub:dts-heritage-avs-sbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-HERITAGE-AVS-SBOX"].azuread_group_member.members["Azure Kubernetes Service Cluster Admin Role-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "a6ce5b32-e0a5-419e-ba5c-67863c975941"
    }

  # module.subscription["DTS-HERITAGE-AVS-SBOX"].azuread_group_member.members["Contributor-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab"
    }

  # module.subscription["DTS-HERITAGE-AVS-SBOX"].azuread_group_member.members["Contributor-1"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

4780-807c-7be8301ae99b"
              + type = "Role"
            }
          + resource_access {
              + id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"
              + type = "Role"
            }
        }
      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "06da0dbc-49e2-44d2-8312-53f166ab848a" -> null
              - type = "Scope" -> null
            }
        }

      ~ web {
          ~ homepage_url  = "https://dts-bootstrap-application" -> "https://dev.azure.com/hmcts/PlatformOperations"
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = "c2ed50eb-7f89-4c36-be94-f38c4f1e4a30"
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster admin permissions to the HMCTS-SOC-SBOX subscription"
      + display_name                   = "DTS AKS Administrators (sub:hmcts-soc-sbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster user permissions to the HMCTS-SOC-SBOX subscription"
      + display_name                   = "DTS AKS Users (sub:hmcts-soc-sbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azuread_group.groups["Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "HMCTS-SOC-SBOX Subscription Contributors" -> "Grants contributor permissions to the HMCTS-SOC-SBOX subscription"
        id                         = "2fc13573-2533-4003-ab4a-9820c6d574c1"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azuread_group.groups["Key Vault Administrator"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants key vault administrator permissions to the HMCTS-SOC-SBOX subscription"
      + display_name                   = "DTS Key Vault Administrators (sub:hmcts-soc-sbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azuread_group.groups["Owner"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "HMCTS-SOC-SBOX Subscription Owners" -> "Grants owner permissions to the HMCTS-SOC-SBOX subscription"
        id                         = "b6b6d31d-2726-486a-a7c0-b8920b69874d"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azuread_group.groups["Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "HMCTS-SOC-SBOX Subscription Readers" -> "Grants reader permissions to the HMCTS-SOC-SBOX subscription"
        id                         = "3c2e1915-f50e-41d2-b10d-8c5202958af1"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azuread_group.groups["Security Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants security reader permissions to the HMCTS-SOC-SBOX subscription"
      + display_name                   = "DTS Security Readers (sub:hmcts-soc-sbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azuread_group.groups["Storage Blob Data Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "HMCTS-SOC-SBOX Subscription Blob Readers" -> "Grants storage blob data contributor permissions to the HMCTS-SOC-SBOX subscription"
        id                         = "e308c63b-727f-4002-8229-52fd4b6fb9ef"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azuread_group_member.members["Azure Kubernetes Service Cluster Admin Role-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "a6ce5b32-e0a5-419e-ba5c-67863c975941"
    }

  # module.subscription["HMCTS-SOC-SBOX"].azuread_group_member.members["Contributor-2"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "2fc13573-2533-4003-ab4a-9820c6d574c1"
      + id               = (known after apply)
      + member_object_id = "0ec60e03-4262-44ce-abcf-83e2131c9207"
    }

  # module.subscription["HMCTS-SOC-SBOX"].azuread_group_member.members["Key Vault Administrator-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab"
    }

  # module.subscription["HMCTS-SOC-SBOX"].azuread_group_member.members["Key Vault Administrator-1"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "fb742e1c-0516-4435-b344-c0589315704c"
    }

  # module.subscription["HMCTS-SOC-SBOX"].azuread_group_member.members["Owner-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "b6b6d31d-2726-486a-a7c0-b8920b69874d"
      + id               = (known after apply)
      + member_object_id = "fb742e1c-0516-4435-b344-c0589315704c"
    }

  # module.subscription["HMCTS-SOC-SBOX"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                        = "bf865b06-ae50-4286-9073-1188f185b01d"
        # (7 unchanged attributes hidden)

      + credentials {
          + serviceprincipalid  = "9d9427a1-05e2-4cf4-90bb-c92dadb52892"
          + serviceprincipalkey = (sensitive value)
        }

        # (1 unchanged block hidden)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c2307d175515529b845f2kv"
        name                            = "c2307d175515529b845f2kv"
      ~ tags                            = {
          ~ "application"  = "core" -> "security"
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azurerm_key_vault_secret.aks_admin_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c2307d175515529b845f2kv"
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azurerm_key_vault_secret.aks_user_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_user_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c2307d175515529b845f2kv"
      + name                    = "aks-user-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
      + content_type            = ""
        id                      = "https://c2307d175515529b845f2kv.vault.azure.net/secrets/sp-token/b625a0ae5d5a41af8bb01a7746774692"
        name                    = "sp-token"
        tags                    = {}
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster Admin Role"
      + scope                            = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster User Role"
      + scope                            = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azurerm_role_assignment.local_groups["Key Vault Administrator"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azurerm_role_assignment.local_groups["Security Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azurerm_storage_account.sa will be updated in-place
  ~ resource "azurerm_storage_account" "sa" {
      + cross_tenant_replication_enabled  = true
        id                                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.Storage/storageAccounts/c2307d175515529b845f2sa"
      ~ min_tls_version                   = "TLS1_0" -> "TLS1_2"
        name                              = "c2307d175515529b845f2sa"
      ~ tags                              = {
          ~ "application"  = "core" -> "security"
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise"
            # (3 unchanged elements hidden)
        }
        # (34 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azurerm_subscription.this will be updated in-place
  ~ resource "azurerm_subscription" "this" {
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/233705"
        id                = "/providers/Microsoft.Subscription/aliases/HMCTS-SOC-SBOX"
        tags              = {}
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["HMCTS-SOC-SBOX"].random_uuid.acme_app_uuid[0] will be created
  + resource "random_uuid" "acme_app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["HMCTS-SOC-SBOX"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["HMCTS-SOC-SBOX"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 157 to add, 70 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":45,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->